In [4]:
import pandas as pd
pd.__version__

'2.3.3'

In [5]:
import pandas as pd
import numpy as np

In [7]:
data = pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [8]:
data.index

RangeIndex(start=0, stop=4, step=1)

- CUSTOMIZE INDEX

In [9]:
data = pd.Series([0.25,0.5,0.75,1.0]
                ,index=['a','b','c','d'])

In [10]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

- COSTUMIZE WITH `DICT`

In [16]:
population_dict = {
    'California': 38332521, 
    'Texas': 26448193, 
    'New York': 19651127,
    'Florida': 19552860,
    'Illinois': 12882135}

population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [17]:
population["California"]

np.int64(38332521)

- SLICING

In [18]:
population['California':'Florida']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

# The Pandas DataFrame Object

In [21]:
area_dict = {
    'California': 423967,
    'Texas': 695662,
    'New York': 141297,
    'Florida': 170312, 
    'Illinois': 149995
}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [23]:
states = pd.DataFrame(
    {'population':population, # DICT
      'area': area}
)
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [25]:
print("INDEX: ",end='')
print(states.index)
print("COlUMNS: ",end='')
print(states.columns)

INDEX: Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')
COlUMNS: Index(['population', 'area'], dtype='object')

In [26]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

- Constructing DataFrane Objects

In [28]:
pd.DataFrame(population,columns=['populatuion'])

            populatuion
California     38332521
Texas          26448193
New York       19651127
Florida        19552860
Illinois       12882135

In [29]:
data = [
    {'a': i,'b': i**2} for i in range(7)
]
pd.DataFrame(data)

   a   b
0  0   0
1  1   1
2  2   4
3  3   9
4  4  16
5  5  25
6  6  36

In [32]:
pd.DataFrame([{'a':1,'b':2},{'b':3,'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [33]:
pd.DataFrame({'population':population,
             'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [34]:
pd.DataFrame(np.random.rand(3,2), 
            columns = ["foo","bar"], 
            index=['a','b','c'])

        foo       bar
a  0.287058  0.723663
b  0.673799  0.545783
c  0.570132  0.874881

In [ ]:
A = np.zeros(3,dtype = )